{"message":"Request failed with status code 400","name":"AxiosError","stack":"AxiosError: Request failed with status code 400\n    at settle (/Users/romany/projects/Igloo/scripts/node_modules/axios/dist/node/axios.cjs:1967:12)\n    at IncomingMessage.handleStreamEnd (/Users/romany/projects/Igloo/scripts/node_modules/axios/dist/node/axios.cjs:3062:11)\n    at IncomingMessage.emit (node:events:531:35)\n    at endReadableNT (node:internal/streams/readable:1696:12)\n    at process.processTicksAndRejections (node:internal/process/task_queues:82:21)","config":{"transitional":{"silentJSONParsing":true,"forcedJSONParsing":true,"clarifyTimeoutError":false},"adapter":["xhr","http"],"transformRequest":[null],"transformResponse":[null],"timeout":0,"xsrfCookieName":"XSRF-TOKEN","xsrfHeaderName":"X-XSRF-TOKEN","maxContentLength":-1,"maxBodyLength":-1,"env":{},"headers":{"Accept":"application/json, text/plain, */*","Content-Type":"application/json","User-Agent":"axios/1.6.2","Content-Length":"12528","Accept-Encoding":"gzip, compress, deflate, br"},"baseURL":"http://localhost:8080/api/v1","method":"post","url":"/musician","data":"{\"name\":\"Aerosmith\",\"summary\":\"Specializing in raunchy, sleazy boogie and melodramatic ballads, Aerosmith were one of the biggest hard rock bands to emerge in the 1970s, shaping the sound and style of hard rock and metal in the decades to come. The Boston-based quintet found the middle ground between the menace of the Rolling Stones and the campy, sleazy flamboyance of the New York Dolls, developing a lean, dirty riff-oriented boogie that was loose and swinging and as hard as a diamond. In the meantime, they developed a prototype for power ballads with \\\"Dream On\\\" using a piano orchestrated with strings and distorted guitars. Aerosmith's ability to pull off both ballads and rock & roll made them extremely popular during the mid-'70s, when they had a string of gold and platinum albums. By the early '80s, the group's audience had declined as the band fell prey to drug and alcohol abuse, setting the stage for one of the most remarkable comebacks in rock history. A cleaned-up Aerosmith happily adapted to an era of MTV and corporate rock without losing their cheerfully trashy essence, giving them a series of smashes in the late '80s and '90s that helped sustain their popularity into the 2020s, when they launched a farewell tour on their 50th anniversary.\\r\\nIn 1970, the first incarnation of Aerosmith formed when vocalist Steven Tyler met guitarist Joe Perry while working at a Sunapee, New Hampshire, ice cream parlor. Tyler, who was originally a drummer, and Perry decided to form a power trio with bassist Tom Hamilton. The group soon expanded to a quartet, adding a second guitarist called Ray Tabano; he was quickly replaced by Brad Whitford, a former member of Earth Inc. With the addition of drummer Joey Kramer, Tyler became the full-time lead singer by the end of year. Aerosmith relocated to Boston at the end of 1970.\\r\\nAfter playing clubs in the Massachusetts and New York areas for two years, the group landed a record contract with Columbia in 1972. Aerosmith's self-titled debut album was released in the fall of 1973, climbing to number 166. \\\"Dream On\\\" was released as the first single and it was a minor hit, reaching number 59. The next year, the band built a fan base by touring America, supporting groups as diverse as the Kinks, Mahavishnu Orchestra, Sha Na Na, and Mott the Hoople. The performance of Get Your Wings (1974), the group's second album and the first produced by Jack Douglas, benefited from their constant touring, spending a total of 86 weeks on the chart.\\r\\nAerosmith's third effort, 1975's Toys in the Attic, was their breakthrough album both commercially and artistically. By the time it was recorded, the band's sound had developed into sleek, driving hard rock powered by simple, almost brutal, blues-based riffs. Many critics at the time labeled the group punk rockers, and it's easy to see why -- instead of adhering to the world music pretensions of Led Zeppelin or the prolonged gloomy mysticism of Black Sabbath, Aerosmith stripped heavy metal to its basic core, spitting out spare riffs that not only rocked, but rolled. Steven Tyler's lyrics were filled with double entendres and clever jokes, and the entire band had a streetwise charisma that separated them from the heavy, lumbering arena rockers of the era. Toys in the Attic captured the essence of the newly invigorated Aerosmith. \\\"Sweet Emotion,\\\" the first single from Toys in the Attic, broke into the Top 40 in the summer of 1975, with the album reaching number 11 shortly afterward. Its success prompted the re-release of the power ballad \\\"Dream On,\\\" which shot into the Top Ten in early 1976. Both Aerosmith and Get Your Wings climbed back up the charts in the wake of Toys in the Attic. \\\"Walk This Way,\\\" the final single from Toys in the Attic, was released around the time of the group's new 1976 album, Rocks. Although it didn't feature a Top Ten hit like \\\"Walk This Way,\\\" Rocks went platinum quickly, peaking at number three.\\r\\nIn early 1977, Aerosmith took a break and prepared material for their fifth album. Released late in 1977, Draw the Line was another hit, climbing to number 11 on the U.S. charts, but it showed signs of exhaustion. In addition to another tour in 1978, the band appeared in the movie Sgt. Pepper's Lonely Hearts Club Band, performing \\\"Come Together,\\\" which eventually became a number 23 hit. Live! Bootleg appeared late in 1978 and became another success, reaching number 13. Aerosmith recorded Night in the Ruts in 1979, releasing the record at the end of the year. By the time of its release, Joe Perry had left the band to form the Joe Perry Project. Night in the Ruts performed respectably, climbing to number 14 and going gold, yet it was the least successful Aerosmith record to date. Brad Whitford left the group in early 1980, forming the Whitsford-St. Holmes Band with former Ted Nugent guitarist Derek St. Holmes.\\r\\nAs Aerosmith regrouped with new guitarists Jimmy Crespo and Rick Dufay, the band released Aerosmith's Greatest Hits in late 1980; the record would eventually sell over six million copies. The new lineup of Aerosmith released Rock in a Hard Place in 1982. Peaking at number 32, it failed to match the performance of Night in the Ruts. Perry and Whitford returned to the band in 1984 and the group began a reunion tour dubbed Back in the Saddle. Early in the tour, Tyler collapsed on-stage, offering proof that the bandmembers hadn't conquered their notorious drug and alcohol addictions. The following year, Aerosmith released Done with Mirrors, the original lineup's first record since 1979 and their first for Geffen Records. Although it didn't perform as well as Rock in a Hard Place, the album showed that the band was revitalized.\\r\\nAfter the release of Done with Mirrors, Tyler and Perry completed rehabilitation programs. In 1986, the pair appeared on Run-D.M.C.'s cover of \\\"Walk This Way,\\\" along with appearing in the video. \\\"Walk This Way\\\" became a hit, reaching number four and receiving saturation airplay on MTV. \\\"Walk This Way\\\" set the stage for the band's full-scale comeback effort, the Bruce Fairbairn-produced Permanent Vacation (1987). Tyler and Perry collaborated with professional hard rock songwriters like Holly Knight and Desmond Child, resulting in the hits \\\"Dude (Looks Like a Lady),\\\" \\\"Rag Doll,\\\" and \\\"Angel.\\\" Permanent Vacation peaked at number 11 and sold over three million copies.\\r\\nPump, released in 1989, continued the band's winning streak, reaching number five, selling over four million copies, and spawning the Top Ten singles \\\"Love in an Elevator,\\\" \\\"Janie's Got a Gun,\\\" and \\\"What It Takes.\\\" Aerosmith released Get a Grip in 1993. Like Permanent Vacation and Pump, Get a Grip was produced by Bruce Fairbairn and featured significant contributions by professional songwriters. The album was as successful as the band's previous two records, featuring the hit singles \\\"Livin' on the Edge,\\\" \\\"Cryin',\\\" and \\\"Amazing.\\\" In 1994, Aerosmith released Big Ones, a compilation of hits from their Geffen years that fulfilled their contract with the label; it went double platinum shortly after its release.\\r\\nWhile Aerosmith was at the height of their revitalized popularity in the early '90s, the group signed a lucrative multi-million-dollar contract with Columbia Records, even though they still owed Geffen two albums. It wasn't until 1995 that the band was able to begin working on their first record under the new contract -- nearly five years after the contract was signed. The making of Aerosmith albums usually had been difficult affairs, but the recording of Nine Lives was plagued with bad luck. The band went through a number of producers and songwriters before settling on Kevin Shirley in 1996. More damaging, however, was the dismissal of the band's manager, Tim Collins, who'd been responsible for bringing the band back from the brink of addiction. Upon his firing, Collins insinuated that Steven Tyler was using hard drugs again, an allegation that Aerosmith adamantly denied.\\r\\nUnder such circumstances, recording became quite difficult, and when Nine Lives finally appeared in the spring of 1997, it was greeted with great anticipation, yet the initial reviews were mixed and even though album debuted at number one, it quickly fell down the charts. The live A Little South of Sanity followed in 1998. Three years later, Aerosmith strutted their stuff on the Super Bowl halftime special on CBS with the likes of Mary J. Blige, Nelly, *NSYNC, and Britney Spears, just prior to issuing their heart-stomping Just Push Play in March 2001. Next up for the band was a blues album, Honkin' on Bobo, released in 2004, along with two live albums/DVDs, You Gotta Move and Rockin' the Joint. Another greatest-hits collection, Devil's Got a New Disguise: The Very Best of Aerosmith arrived in 2006.\\r\\nFrom there, Aerosmith entered a period of volatility. A world tour followed in 2007 and the group attempted to record a new studio album with producer Brendan O'Brien but the sessions were never finalized. Instead, another tour followed in 2009, this time a supporting jaunt for Aerosmith's own special edition of the Guitar Hero video game. This tour proved to be ill-fated, with Steven Tyler suffering a leg injury in June, then falling off the stage in August, leading to the cancellation of the subsequent dates. As 2009 came to a close, Joe Perry released a solo album called Have Guitar, Will Travel as Tyler announced that he was planning on \\\"working on the brand of myself,\\\" which included working on an autobiography and a solo album, along with a stint in rehab to wean himself off painkillers prescribed due to his stage injuries.\\r\\nBefore Tyler embarked on solo projects, he returned to the band for a series of concerts in 2010, in the midst of which it was announced that the singer would be a new judge on the televised singing competition American Idol. Perry voiced his dissatisfaction in the press but Tyler's time on American Idol helped raise the band's profile, while providing a platform for Tyler's memoir, Does the Noise in My Head Bother You? The book performed better than his two solo singles -- 2010's \\\"Love Lives\\\" and 2011's \\\"(It) Feels So Good\\\" -- singles that did not wind up signaling his departure from Aerosmith. Tyler continued to tour with the band and in 2011 they recorded a new album with producer Jack Douglas, the man who helmed their classic '70s LPs. Originally scheduled for release in summer of 2012, Music from Another Dimension! wound up being pushed back to that year's holiday season, by which time Tyler had departed his judgeship on American Idol.\\r\\nAerosmith stayed on the road through 2013 and 2014, releasing such live souvenirs as Rock for the Rising Sun and Aerosmith Rocks Donington during this period. Solo projects kept the various members of the band busy: Joe Perry published his memoir Rocks: My Life in and Out of Aerosmith in 2014 then turned his attention to Hollywood Vampires, Steven Tyler released his country-tinged solo album We're All Somebody from Somewhere in 2016, while Joey Kramer concentrated on his coffee company, Rockin' & Roastin'. In 2015, several members floated the idea of a farewell tour, but those plans remained in an embryonic stage for a good spell while Perry continued to work in Hollywood Vampires and released another solo album, Sweetzerland Manifesto, in 2018. That year, the band staged Aerosmith: Deuces are Wild, a Las Vegas residency that ran through 2019; it was postponed in 2020 due to the COVID-19 pandemic. During this period, Joey Kramer injured his shoulder. He managed to play the final dates in the Vegas residency but by the time the band returned to the road in 2022, it was announced that Kramer would not participate and wanted to focus on his family.\\r\\nAfter wrapping up their Vegas commitments and holding a long-delayed 50th anniversary concert at Fenway Park in 2022, Aerosmith launched Peace Out: The Farewell Tour in September 2023. After three dates, Tyler suffered bleeding vocal cords, leading the band to postpone several concert dates until 2024. ~ Stephen Thomas Erlewine\",\"thumb\":\"public/images/musicians/thumb/63923319-a87a-4c6a-9029-c6a533b1f000.png\",\"art\":\"public/images/musicians/art/9fd61359-b2f2-4324-b1d2-2b6fd528ab72.png\",\"genres\":[{\"ID\":1,\"CreatedAt\":\"2024-01-09T16:13:10.599464-04:00\",\"UpdatedAt\":\"2024-01-09T16:13:10.599464-04:00\",\"DeletedAt\":null,\"tag\":\"Pop/Rock\",\"musicians\":null,\"albums\":null,\"tracks\":null,\"users\":null}]}"},"code":"ERR_BAD_REQUEST","status":400}